---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TilePatternTileFailures.TilePatternTile_InvalidFamily
source: html/205447de-f325-7456-41cc-b0f01ed9aa2b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TilePatternTileFailures.TilePatternTile_InvalidFamily Property

Family not appropriate for Divided Surface component.

## Syntax (C#)
```csharp
public static FailureDefinitionId TilePatternTile_InvalidFamily { get; }
```